package com.xck.str;

import org.apache.commons.lang.RandomStringUtils;
import org.apache.commons.lang.StringUtils;

import java.util.ArrayList;
import java.util.List;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class TempleteContentTest {

    private static final int CHINA = 1;
    private static final int DEFAULT = 0;
    private static String[] templeteArr;

    static {
        String templete1 = ".*【Keep】.*";
        String templete2 = ".*【京东互联网医院】.*";
        String templete3 = ".*【昆山平安驾驶员培训股份有限公司】.*";
        String templete4 = ".*【贝店】.*";
        templeteArr = new String[4];
        templeteArr[0] = templete1;
        templeteArr[1] = templete2;
        templeteArr[2] = templete3;
        templeteArr[3] = templete4;
    }

    public static void main(String[] args) {
//        testFourTempleteAndRnandom();
        testMultiTemplete();
//        testMultiTemplete1();
//        matchTempleteInIndexOf();
    }

    //匹配的字符串长度: 343
    //模板数量: 1169
    //最大耗时1558ms
    //调用20次，匹配模板平均耗时951.550000ms
    public static void testMultiTemplete(){
        String content = "阿yt什mfaqkthl发ygX都X什gXf门刻g发儿kthlm开f发h都时u发ad此开w此xXh儿刻umdX开mxgx刻s此s时f儿s儿XXX后门t花X顿gkrfpb发X时sli阿了y此zwX后m儿开ig最此aXXoisql开X最oa儿后顿z发nm此X花发s最开开l了x花时Xug最k顿t时h阿r花X此lqXl儿Xq发了gdvdu最X了hiXX刻gc门刻oa此g儿花go都w后tour时最Xo刻nk门门后门alaXtr后gXbtu儿开后fr开X时X花ryf时vqi此h了p阿r开lq阿时顿kXcuh发XXuXXmp此XdmXX花kX此Xuy花m门儿p都tXaq刻z刻i发iwz最uh最刻uX时了fvg花p发socX花gXzrli花开riv最儿了XozwfXx阿f顿dp刻了XX发花X时【张X】";
        int length = content.length();

        System.out.println("匹配的字符串长度: " + length);

        String[] templeteArr = templeteStr.split("\n");
        System.out.println("模板数量: " + templeteArr.length);

        List<Pattern> list = new ArrayList<>();

        for (int i = 0; i < templeteArr.length; i++) {
            templeteArr[i] = templeteArr[i].replaceFirst("... ...", "");
            list.add(Pattern.compile(templeteArr[i]));
        }

        long useTime = 0;
        long useMaxTime = 0;
        for (int i=0; i<20; i++) {
            long start = System.currentTimeMillis();
            for(Pattern pattern : list){
                System.out.println(match(content, pattern));;
            }
            long diff = System.currentTimeMillis() - start;
            useMaxTime = diff > useMaxTime ? diff : useMaxTime;
            useTime+=diff;
        }

        System.out.println(String.format("最大耗时%dms", useMaxTime));
        System.out.println(String.format("调用20次，匹配模板平均耗时%fms", ((double)useTime/20)));
    }

    /**
     * 问题数据的indexof匹配测试
     */
    public static void testMultiTemplete1(){
        String content = "【建屋物业明日星城管理处】尊敬的明日星城业主您好：近日受强冷空气影响，我市将有中到大雪，气温下降8-12度，建屋物业在此温馨提醒您：1、雨雪天气地面湿滑，请您外出时注意防滑，小心慢行；驾驶车辆外出时请谨慎慢行；3、在此期间，可能会出现大风现象，请您收回自家阳台和户外的花盆、衣物等易被风吹落的物品，以免高空坠物伤人；请不要在玻璃门窗、广告牌、大树附近行走或停留，以免发生意外；4、使用取暖器、电热毯等电器设备时请注意安全，离开房间要及时关闭电源，以免发生火灾；5、请您及时关好门窗，做好室内各种水阀的保温防冻措施，如外出长期不住时，请提前关好室外水阀，排空管内积水，避免造成管道冻裂；祝您阖家安康！物业服务热线：0527-82868166。24小时服务热线：0527-82868611。";
        int length = content.length();

        System.out.println("匹配的字符串长度: " + length);

        String[] templeteArr = templeteStr.split("\n");
        System.out.println("模板数量: " + templeteArr.length);

        long useTime = 0;
        long useMaxTime = 0;
        for (int i=0; i<2000; i++) {
            long start = System.currentTimeMillis();
            for(String templete : templeteArr){
                String[] keyWords = templete.split("... ...");
                boolean isTre = true;
                int index = -1;
                for(String tmp : keyWords){
                    if(StringUtils.isBlank(tmp)) continue;
                    if((index = content.indexOf(tmp, index)) == -1){
                        isTre = false;
                        break;
                    }
                }
//                if(isTre) sout
            }
            long diff = System.currentTimeMillis() - start;
            useMaxTime = diff > useMaxTime ? diff : useMaxTime;
            useTime+=diff;
        }

        System.out.println(String.format("最大耗时%dms", useMaxTime));
        System.out.println(String.format("调用2000次，匹配模板平均耗时%fms", ((double)useTime/2000)));
    }

    public static void testFourTempleteAndRnandom(){
        String content = "【建屋物业明日星城管理处】尊敬的明日星城业主您好：近日受强冷空气影响，我市将有中到大雪，气温下降8-12度，建屋物业在此温馨提醒您：1、雨雪天气地面湿滑，请您外出时注意防滑，小心慢行；驾驶车辆外出时请谨慎慢行；3、在此期间，可能会出现大风现象，请您收回自家阳台和户外的花盆、衣物等易被风吹落的物品，以免高空坠物伤人；请不要在玻璃门窗、广告牌、大树附近行走或停留，以免发生意外；4、使用取暖器、电热毯等电器设备时请注意安全，离开房间要及时关闭电源，以免发生火灾；5、请您及时关好门窗，做好室内各种水阀的保温防冻措施，如外出长期不住时，请提前关好室外水阀，排空管内积水，避免造成管道冻裂；祝您阖家安康！物业服务热线：0527-82868166。24小时服务热线：0527-82868611。";
        int length = content.length();

        System.out.println("匹配的字符串长度: " + length);


        for(String templete : templeteArr){
            Pattern pattern = Pattern.compile(templete);
            long useTime = 0;
            for(int i=0; i<20; i++){
                useTime+=testMatch(length, DEFAULT, 10000, pattern);
            }
            System.out.println(String.format("英文+数字,匹配模板%s耗时%fms", templete, ((double)useTime/20/10000)));

            useTime = 0;
            for(int i=0; i<20; i++){
                useTime+=testMatch(length, CHINA, 10000, pattern);
            }
            System.out.println(String.format("中文,匹配模板%s耗时%fms", templete, ((double)useTime/20/10000)));
        }
    }

    /**
     * 匹配测试
     * @param len
     * @param type
     * @return
     */
    public static long testMatch(int len, int type, int times, Pattern templete) {
        long useTimes = 0;
        for (int i=0; i<times; i++) {
            String content = randomString(len, type);
            long start = System.currentTimeMillis();
            match(content, templete);
            useTimes += System.currentTimeMillis() - start;
        }
        return useTimes;
    }

    /**
     * 随机生成三种类型的字符串，英文+数字，纯中文(0x4e00-0x9fa5)，中文+其他(utf8编码0x0000-0x9fa5)，字符串长度是343
     * 调用n次，每次循环m次，循环每次都会拿到一个字符串，匹配固定的模板.*【Keep】.*
     *
     * 1. 英文+数字，调用20次，每次循环10000次，每次调用耗时5646ms
     * 2. 英文+数字，调用10次，每次循环10000次，每次调用耗时5792ms
     * 3. 英文+数字，调用10次，每次循环1200次，每次调用耗时755ms，平均0.62ms
     *
     * 4. 中文+其他，调用20次，每次循环10000次，每次调用耗时5330ms
     * 5. 纯中文，调用20次，每次循环10000次，每次调用耗时7744ms
     *
     * 模板缓存：.*【昆山平安驾驶员培训股份有限公司】.*
     * 1. 英文+数字，调用10次，每次循环2000次，每次调用耗时1224ms，平均0.6ms
     *
     * @param content
     * @return
     */
    public static boolean match(String content, Pattern pattern) {
        content = content.replace("\\s", "");
        Matcher matcher = pattern.matcher(content);
        return matcher.find();
    }

    /**
     * 模板内容事先随机生成好，每次匹配的内容都是会随机一次：
     * 2000个模板，每个模板3个关键词，每个关键词长度30，匹配的内容长度250，调用100次，匹配模板平均耗时1ms左右
     *
     * 5000个模板，每个模板3个关键词，每个关键词长度15，匹配的内容长度250，调用2000次，匹配模板平均耗时1.927500ms
     * 5000个模板，每个模板3个关键词，每个关键词长度20，匹配的内容长度250，调用2000次，匹配模板平均耗时2.327500ms
     * 5000个模板，每个模板3个关键词，每个关键词长度30，匹配的内容长度250，调用2000次，匹配模板平均耗时1.634000ms
     *
     * 1w个模板，每个模板3个关键词，每个关键词长度30，匹配的内容长度250，调用2000次，匹配模板平均耗时3.651000ms
     * 1w个模板，每个模板3个关键词，每个关键词长度30，匹配的内容长度250，调用100次，匹配模板平均耗时3~4ms
     */
    public static void matchTempleteInIndexOf(){
        int templeteSize = 2000;
        int testTimes = 100;

        //构建数据
        List<String[]> list = new ArrayList<>(templeteSize);
        for(int i=0; i<templeteSize; i++){
            String[] keywords = new String[3];
            for(int j=0; j<keywords.length; j++){
                keywords[j] = randomString(30, 1);
            }
            list.add(keywords);
        }

        long time = 0;
        for(int i=0; i<testTimes; i++){
            String content = randomString(250, 1);
            long start = System.currentTimeMillis();
            for(String[] templete : list){
                int index = -1;
                for(String tmp : templete){
                    if(StringUtils.isBlank(tmp)) continue;
                    if((index = content.indexOf(tmp, index)) == -1){

                    }
                }
            }
            time += (System.currentTimeMillis() - start);
        }
        System.out.println(String.format("调用%d次，匹配模板平均耗时%fms", testTimes, ((double)time/testTimes)));
    }

    public static void matchTempleteInSunday(){
        int templeteSize = 2000;
        int testTimes = 100;

        //构建数据
        List<String[]> list = new ArrayList<>(templeteSize);
        for(int i=0; i<templeteSize; i++){
            String[] keywords = new String[3];
            for(int j=0; j<keywords.length; j++){
                keywords[j] = randomString(30, 1);
            }
            list.add(keywords);
        }

        long time = 0;
        for(int i=0; i<testTimes; i++){
            String content = randomString(250, 1);
            long start = System.currentTimeMillis();
            for(String[] keywords : list){
                
            }
            time += (System.currentTimeMillis() - start);
        }
        System.out.println(String.format("调用%d次，匹配模板平均耗时%fms", testTimes, ((double)time/testTimes)));
    }

    public static void sundayMatch(int i, char[] templet, char[] array){

    }


    /**
     * 随机生成字符串
     * @param len 生成字符串的长度
     * @param type 默认英文+数字；1-中文+数字
     * @return
     */
    public static String randomString(int len, int type){
        if(1 == type){
            return RandomStringUtils.random(len, 0x4e00, 0x9fa5, true,true);
        }else {
            return RandomStringUtils.random(len, true,true);
        }
    }

    /**
     * 线上的问题数据
     */
    private static String templeteStr =
            "... ...【U号租】... ...\n" +
            "... ...【爱心公益】... ...\n" +
            "... ...【代练妈妈】... ...验证码... ...\n" +
            "... ...和... ...校... ...园... ...\n" +
            "... ...【和校园】... ...\n" +
            "... ...【北京热力】... ...\n" +
            "... ...【Farfetch】... ...\n" +
            "... ...【庭秘密app】... ...\n" +
            "... ...【菜鸟裹裹】... ...\n" +
            "... ...【好物惠选】... ...\n" +
            "... ...【58到家】... ...\n" +
            "... ...【国网延边供电公司】... ...\n" +
            "... ...【美乐家】... ...\n" +
            "... ...【微保】... ...\n" +
            "... ...【云递配】... ...\n" +
            "... ...【考虫网】... ...\n" +
            "... ...【宝洁】... ...\n" +
            "... ...【全民健康平台】... ...\n" +
            "... ...【叮咚买菜】... ...\n" +
            "... ...【神州专车】... ...\n" +
            "... ...【小米有品】... ...\n" +
            "... ...【红袖读书】... ...\n" +
            "... ...【比亚迪】... ...\n" +
            "... ...【科沃斯机器人】... ...\n" +
            "... ...【魔筷星选】... ...\n" +
            "... ...【星期六】... ...\n" +
            "... ...【护宝星】... ...\n" +
            "... ...【运满满】... ...\n" +
            "... ...【叙州区征兵办公室】... ...\n" +
            "... ...【云集】... ...\n" +
            "... ...【伊利金领冠】... ...\n" +
            "... ...【安徽省政务服务网】... ...\n" +
            "... ...【露安适自营店】... ...\n" +
            "... ...【河套面业官方旗舰店】... ...\n" +
            "... ...【三一卡车】... ...\n" +
            "... ...【蜜丝佛陀自营旗舰店】... ...\n" +
            "... ...【喜拍优创】... ...\n" +
            "... ...【亿管家】... ...\n" +
            "... ...【芸学在线】... ...\n" +
            "... ...【Apple】... ...\n" +
            "... ...【箭牌自营旗舰店】... ...\n" +
            "... ...【滴滴快车】... ...\n" +
            "... ...【趣呗定位】... ...\n" +
            "... ...【安心互联网保险】... ...\n" +
            "... ...【微信支付】... ...\n" +
            "... ...【电科云】... ...\n" +
            "... ...【宅急送】... ...\n" +
            "... ...【郑州高新供水】... ...\n" +
            "... ...【王府井科华店】... ...\n" +
            "... ...【哈啰助力车】... ...\n" +
            "... ...【味多美旗舰店】... ...\n" +
            "... ...【每日优鲜】... ...\n" +
            "... ...【趣铃声】... ...\n" +
            "... ...【麦当劳中国】... ...\n" +
            "... ...【广西壮族自治区医疗保障局】... ...\n" +
            "... ...【泸州老窖官方旗舰店】... ...\n" +
            "... ...【小小优趣】... ...\n" +
            "... ...【如皋档案局档案馆】... ...\n" +
            "... ...【华巨百姓缘】... ...\n" +
            "... ...【伊利】... ...\n" +
            "... ...【成都万象城】... ...\n" +
            "... ...【奉化水务】... ...\n" +
            "... ...【郑州交警】... ...\n" +
            "... ...【广交会】... ...\n" +
            "... ...【商洛卫健】... ...\n" +
            "... ...【必胜客】... ...\n" +
            "... ...【新浩艺】... ...\n" +
            "... ...【贵州省机关事务管理局】... ...\n" +
            "... ...【润联科技】... ...\n" +
            "... ...【全民消糖果】... ...\n" +
            "... ...【OPPO公司】... ...\n" +
            "... ...【盐亭县档案局、盐亭县档案馆】... ...\n" +
            "... ...【诸暨水务】... ...\n" +
            "... ...【礼橙专车】... ...\n" +
            "... ...【华帝股份】... ...\n" +
            "... ...【广东计量协会】... ...\n" +
            "... ...【外国专家局】... ...\n" +
            "... ...【玉环水务】... ...\n" +
            "... ...【浛洸水厂】... ...\n" +
            "... ...【吉林市市场监督管理局】... ...\n" +
            "... ...【楚天发行】... ...\n" +
            "... ...【米读极速版】... ...\n" +
            "... ...【南瑞继保】... ...\n" +
            "... ...【京东】... ...\n" +
            "... ...【快宝驿站】... ...\n" +
            "... ...【美团点评】... ...\n" +
            "... ...【米琳家居】... ...\n" +
            "... ...【玛莎拉蒂互联】... ...\n" +
            "... ...【马蜂窝】... ...\n" +
            "... ...【联韬咨询】... ...\n" +
            "... ...【快递荟】... ...\n" +
            "... ...【金色世纪】... ...\n" +
            "... ...【嘉银咨询】... ...\n" +
            "... ...【呼我出行】... ...\n" +
            "... ...【何记菜掌柜】... ...\n" +
            "... ...【杭州市交通运输局】... ...\n" +
            "... ...【哈尔滨太平国际机场】... ...\n" +
            "... ...【赶考状元】... ...\n" +
            "... ...【甘草医生】... ...\n" +
            "... ...【大麦科技】... ...\n" +
            "... ...【电子居民健康卡】... ...\n" +
            "... ...【常州应急管理局】... ...\n" +
            "... ...【大连国际机场】... ...\n" +
            "... ...【博睿昊康】... ...\n" +
            "... ...【北京数字认证】... ...\n" +
            "... ...【八佰伴智慧购】... ...\n" +
            "... ...【招商到家汇】... ...\n" +
            "... ...【长安民生住久】... ...\n" +
            "... ...【唯爱交友】... ...\n" +
            "... ...【云购街】... ...\n" +
            "... ...【微任务】... ...\n" +
            "... ...【微盛网络】... ...\n" +
            "... ...【凯邦商贸】... ...\n" +
            "... ...【内蒙古大宗】... ...\n" +
            "... ...【店小翼】... ...\n" +
            "... ...【家校网】... ...\n" +
            "... ...【PaperPP】... ...\n" +
            "... ...【易企秀】... ...\n" +
            "... ...【紫勋智能】... ...\n" +
            "... ...【小桔试玩】... ...\n" +
            "... ...【新沂交管助手】... ...\n" +
            "... ...【墨迹天气】... ...\n" +
            "... ...【南京希音】... ...\n" +
            "... ...【京东支付】... ...\n" +
            "... ...【快易通知】... ...\n" +
            "... ...【寰宇科技】... ...\n" +
            "... ...【虎克软件】... ...\n" +
            "... ...【宝贝帮常熟中心】... ...\n" +
            "... ...【YEC青创】... ...\n" +
            "... ...【足迹】... ...\n" +
            "... ...【中税网】... ...\n" +
            "... ...【友谊时光】... ...\n" +
            "... ...【一点英语】... ...\n" +
            "... ...【万仙堂茶叶】... ...\n" +
            "... ...【数马电子】... ...\n" +
            "... ...【沭阳交通管家】... ...\n" +
            "... ...【热猫直播】... ...\n" +
            "... ...【六一游趣】... ...\n" +
            "... ...【聚够云】... ...\n" +
            "... ...【酒易淘商户版】... ...\n" +
            "... ...【简单心理】... ...\n" +
            "... ...【华夏收藏网】... ...\n" +
            "... ...【果果网络】... ...\n" +
            "... ...【互赏】... ...\n" +
            "... ...【腾竞体育】... ...\n" +
            "... ...【亿点智堂】... ...\n" +
            "... ...【吉鲜牧场】... ...\n" +
            "... ...【么么直播】... ...\n" +
            "... ...【贝省】... ...\n" +
            "... ...【葡萄英语】... ...\n" +
            "... ...【上海权衡电子称】... ...\n" +
            "... ...【南通睛喜眼镜城】... ...\n" +
            "... ...【骏途科技】... ...\n" +
            "... ...【会管家】... ...\n" +
            "... ...【货柜里】... ...\n" +
            "... ...【畅由平台】... ...\n" +
            "... ...【海绵MBA】... ...\n" +
            "... ...【波比宠物商城】... ...\n" +
            "... ...【中交三航】... ...\n" +
            "... ...【未闻网络科技】... ...\n" +
            "... ...【玛氏易下单】... ...\n" +
            "... ...【联发创新】... ...\n" +
            "... ...【荐片播放器】... ...\n" +
            "... ...【根云平台】... ...\n" +
            "... ...【冰泉牙膏】... ...\n" +
            "... ...【中维世纪】... ...\n" +
            "... ...【盛利科技传媒】... ...\n" +
            "... ...【统一俱乐部】... ...\n" +
            "... ...【抢多多】... ...\n" +
            "... ...【快递云】... ...\n" +
            "... ...【荔枝铃声】... ...\n" +
            "... ...【滴嘀加油】... ...\n" +
            "... ...【欢遇APP】... ...\n" +
            "... ...【戴尔易安信】... ...\n" +
            "... ...【F网络加速】... ...\n" +
            "... ...【如东移动办公】... ...\n" +
            "... ...【洋皮卷】... ...\n" +
            "... ...【南京妇幼健康】... ...\n" +
            "... ...【马鞍山市协同办公】... ...\n" +
            "... ...【药房网商城】... ...\n" +
            "... ...【南信大网上办事大厅】... ...\n" +
            "... ...【南京猫爪网络科技】... ...\n" +
            "... ...【海湾电商】... ...\n" +
            "... ...【海管家】... ...\n" +
            "... ...【邮政EMS】... ...\n" +
            "... ...【北京交警】... ...\n" +
            "... ...【苏州供水】... ...\n" +
            "... ...【泰州政法委】... ...\n" +
            "... ...【包夫快递】... ...\n" +
            "... ...【邮政】... ...\n" +
            "... ...【恐龙人俱乐部】... ...\n" +
            "... ...【微赞论坛】... ...\n" +
            "... ...【公主购】... ...\n" +
            "... ...【即开高效运营中心】... ...\n" +
            "... ...【超级宝宝】... ...\n" +
            "... ...【云威物联】... ...\n" +
            "... ...【WIFI上网助手】... ...\n" +
            "... ...【药都农商行】... ...\n" +
            "... ...【健康富阳】... ...\n" +
            "... ...【寻梦商贸】... ...\n" +
            "... ...【常州中交】... ...\n" +
            "... ...【茶颜悦色】... ...\n" +
            "... ...【泰州市民卡】... ...\n" +
            "... ...【兴广福】... ...\n" +
            "... ...【立邦涂装俱乐部】... ...\n" +
            "... ...【十分到家服务公司】... ...\n" +
            "... ...【江苏大统华】... ...\n" +
            "... ...【南信大协同办公】... ...\n" +
            "... ...【小盒课堂】... ...\n" +
            "... ...【恋爱圈】... ...\n" +
            "... ...【智能宿迁】... ...\n" +
            "... ...【重庆公积金中心】... ...\n" +
            "... ...【51职查查】... ...\n" +
            "... ...【无锡交警】... ...\n" +
            "... ...【梧桐树】... ...\n" +
            "... ...【WEIQ平台】... ...\n" +
            "... ...【无线苏州】... ...\n" +
            "... ...【G7智慧物联网】... ...\n" +
            "... ...【江苏省智慧校园】... ...\n" +
            "... ...【律聊】... ...\n" +
            "... ...【小帮规划】... ...\n" +
            "... ...【酷秀直播】... ...\n" +
            "... ...【知聊】... ...\n" +
            "... ...【贝壳商城】... ...\n" +
            "... ...【法妞问答】... ...\n" +
            "... ...【上海金属网】... ...\n" +
            "... ...【泊寓】... ...\n" +
            "... ...【中电智恒】... ...\n" +
            "... ...【立邦刷新服务】... ...\n" +
            "... ...【宜春朝文】... ...\n" +
            "... ...【华讯科技传媒】... ...\n" +
            "... ...【抖密】... ...\n" +
            "... ...【贝锐科技】... ...\n" +
            "... ...【医百科技】... ...\n" +
            "... ...【深圳爱问科技】... ...\n" +
            "... ...【名医汇】... ...\n" +
            "... ...【知音楼】... ...\n" +
            "... ...【马拉松奖牌发放】... ...\n" +
            "... ...【恒丰银行】... ...\n" +
            "... ...【EAMic】... ...\n" +
            "... ...【嘉宝】... ...\n" +
            "... ...【穗子科技】... ...\n" +
            "... ...【上海君雅】... ...\n" +
            "... ...【果冻宝盒】... ...\n" +
            "... ...【新时代国珍】... ...\n" +
            "... ...【e高速】... ...\n" +
            "... ...【数字校园】... ...\n" +
            "... ...【准题库】... ...\n" +
            "... ...【天天科技】... ...\n" +
            "... ...【闪电转】... ...\n" +
            "... ...【兴化交警】... ...\n" +
            "... ...【麦德龙】... ...\n" +
            "... ...【无锡公交】... ...\n" +
            "... ...【泗洪数字城管】... ...\n" +
            "... ...【婵之云】... ...\n" +
            "... ...【九洲同播】... ...\n" +
            "... ...【寓小二】... ...\n" +
            "... ...【老黄历万年历】... ...\n" +
            "... ...【火花Chat】... ...\n" +
            "... ...【住这儿】... ...\n" +
            "... ...【和 校 园】... ...\n" +
            "... ...【映客直播】... ...\n" +
            "... ...【星威网络】... ...\n" +
            "... ...【江苏微解纷】... ...\n" +
            "... ...【贝壳租房】... ...\n" +
            "... ...【上海同鑫】... ...\n" +
            "... ...【威行】... ...\n" +
            "... ...【快看点】... ...\n" +
            "... ...【DIGI】... ...\n" +
            "... ...【好孩子】... ...\n" +
            "... ...【一代油侠】... ...\n" +
            "... ...【微赞直播】... ...\n" +
            "... ...【第一弹】... ...\n" +
            "... ...【千聊】... ...\n" +
            "... ...【普联技术有限公司】... ...\n" +
            "... ...【华住会】... ...\n" +
            "... ...【蛋壳公寓】... ...\n" +
            "... ...【贝壳新房】... ...\n" +
            "... ...【揽众科技】... ...\n" +
            "... ...【智医助理】... ...\n" +
            "... ...【来取】... ...\n" +
            "... ...【好未来】... ...\n" +
            "... ...【贝壳找房】... ...\n" +
            "... ...【星展银行】... ...\n" +
            "... ...【奇团网】... ...\n" +
            "... ...【灰蚂蚁到家】... ...\n" +
            "... ...【郴汽集团】... ...\n" +
            "... ...【外研社】... ...\n" +
            "... ...【重庆政务】... ...\n" +
            "... ...【VST众星俱乐部】... ...\n" +
            "... ...【乐璟社区】... ...\n" +
            "... ...【福特商城】... ...\n" +
            "... ...【番茄生活】... ...\n" +
            "... ...【拇指医生】... ...\n" +
            "... ...【易到用车】... ...\n" +
            "... ...【哈药集团】... ...\n" +
            "... ...【东呈集团】... ...\n" +
            "... ...【糖呗社交】... ...\n" +
            "... ...【熊猫快收】... ...\n" +
            "... ...【龙邦速递】... ...\n" +
            "... ...【大河车展】... ...\n" +
            "... ...【安利物流】... ...\n" +
            "... ...【建造师快聘网】... ...\n" +
            "... ...【星火矿池】... ...\n" +
            "... ...【荟萃楼】... ...\n" +
            "... ...【同程商旅】... ...\n" +
            "... ...【外研AI】... ...\n" +
            "... ...【网力旅游】... ...\n" +
            "... ...【民乐社康】... ...\n" +
            "... ...【南京车管】... ...\n" +
            "... ...【民航快递】... ...\n" +
            "... ...【顺丰速运】... ...\n" +
            "... ...【润通物流】... ...\n" +
            "... ...【芜湖市教育局】... ...\n" +
            "... ...【刺猬教育】... ...\n" +
            "... ...【临沂市教育收费】... ...\n" +
            "... ...【创亚教育】... ...\n" +
            "... ...【汉阳基教】... ...\n" +
            "... ...【子午孕教泉州温陵路】... ...\n" +
            "... ...【太原教育】... ...\n" +
            "... ...【忻州教育】... ...\n" +
            "... ...【无锡教信中心】... ...\n" +
            "... ...【张家港教育信息化】... ...\n" +
            "... ...【AMD锐龙店面管家】... ...\n" +
            "... ...【八佰伴镇江店】... ...\n" +
            "... ...【协和便利店】... ...\n" +
            "... ...【美团开店宝】... ...\n" +
            "... ...【常州迪家运动-武进店】... ...\n" +
            "... ...【八佰伴江阴人民中路店】... ...\n" +
            "... ...【SINFRUITS果真妙专卖店】... ...\n" +
            "... ...【沃姆酒店and乐福酒店】... ...\n" +
            "... ...【seeyoung滋源环亚专卖店】... ...\n" +
            "... ...【清沐连锁酒店】... ...\n" +
            "... ...【烨晨跃百货商贸店】... ...\n" +
            "... ...【山里亭万仙堂茶叶专卖店】... ...\n" +
            "... ...【新罗网上免税店】... ...\n" +
            "... ...【八佰伴溧阳店】... ...\n" +
            "... ...【华地百货宜兴店】... ...\n" +
            "... ...【丽呈酒店】... ...\n" +
            "... ...【仁寿光陆生百货店】... ...\n" +
            "... ...【苏德乐家居专营店】... ...\n" +
            "... ...【汇佳诚数码店】... ...\n" +
            "... ...【东呈酒店】... ...\n" +
            "... ...【思加图旗舰店】... ...\n" +
            "... ...【美素旗舰店】... ...\n" +
            "... ...【绿云峰茶叶旗舰店】... ...\n" +
            "... ...【MAP旗舰店】... ...\n" +
            "... ...【百思图旗舰店】... ...\n" +
            "... ...【天美意旗舰店】... ...\n" +
            "... ...【森达旗舰店】... ...\n" +
            "... ...【美肤宝旗舰店】... ...\n" +
            "... ...【九牧官方旗舰店】... ...\n" +
            "... ...【他她旗舰店】... ...\n" +
            "... ...【TinSan旗舰店】... ...\n" +
            "... ...【百丽旗舰店】... ...\n" +
            "... ...【法兰琳卡旗舰店】... ...\n" +
            "... ...【春夏旗舰店】... ...\n" +
            "... ...【雀巢学生营养】... ...\n" +
            "... ...【南方科技大学】... ...\n" +
            "... ...【闲林中心小学】... ...\n" +
            "... ...【常山县第一小学】... ...\n" +
            "... ...【核工业成都机电学校】... ...\n" +
            "... ...【学海优学】... ...\n" +
            "... ...【山东大学】... ...\n" +
            "... ...【江苏大学】... ...\n" +
            "... ...【明兮学堂】... ...\n" +
            "... ...【Civa小学宝】... ...\n" +
            "... ...【弘运府学】... ...\n" +
            "... ...【新桥医院】... ...\n" +
            "... ...【同济大学附属口腔医院】... ...\n" +
            "... ...【通医附院眼镜行】... ...\n" +
            "... ...【优居壹佰张家港如意家院】... ...\n" +
            "... ...【江苏省中医院】... ...\n" +
            "... ...【武汉设计工程学院】... ...\n" +
            "... ...【西南医院】... ...\n" +
            "... ...【泰州市人民医院】... ...\n" +
            "... ...【河北清华发展研究院】... ...\n" +
            "... ...【苏州永鼎医院】... ...\n" +
            "... ...【南通阳光澳洋护理院】... ...\n" +
            "... ...【江苏移动微法院】... ...\n" +
            "... ...【中国特种设备检测研究院】... ...\n" +
            "... ...【深铁建设】... ...\n" +
            "... ...【南京地铁】... ...\n" +
            "... ...【钢铁熊电竞酒店】... ...\n" +
            "... ...【青岛地铁】... ...\n" +
            "... ...【中国铁建】... ...\n" +
            "... ...【铁路工程管理平台】... ...\n" +
            "... ...【中铁建设】... ...\n" +
            "... ...【上海铁路客户服务中心】... ...\n" +
            "... ...【上海中铁】... ...\n" +
            "... ...【济南地铁】... ...\n" +
            "... ...【爱居兔】... ...\n" +
            "... ...【OPPO手机】... ...\n" +
            "... ...【小鹅拼拼】... ...\n" +
            "... ...【香奈儿】... ...\n" +
            "... ...【淘云互动】... ...\n" +
            "... ...【商陆花】... ...\n" +
            "... ...【汽修宝典】... ...\n" +
            "... ...【拇指助手】... ...\n" +
            "... ...【魔力乐学】... ...\n" +
            "... ...【美团闪购】... ...\n" +
            "... ...【酷狗音乐】... ...\n" +
            "... ...【空铁管家】... ...\n" +
            "... ...【客乐芙】... ...\n" +
            "... ...【金联创】... ...\n" +
            "... ...【叫个货车】... ...\n" +
            "... ...【江小鹿】... ...\n" +
            "... ...【家政加】... ...\n" +
            "... ...【航e生活】... ...\n" +
            "... ...【弘智云平台】... ...\n" +
            "... ...【海马体照相馆】... ...\n" +
            "... ...【董记欢乐鸭】... ...\n" +
            "... ...【东威物流】... ...\n" +
            "... ...【东方有礼】... ...\n" +
            "... ...【德道云创系统】... ...\n" +
            "... ...【车来了】... ...\n" +
            "... ...【车位帮】... ...\n" +
            "... ...【保利管道】... ...\n" +
            "... ...【保安通】... ...\n" +
            "... ...【KeyFree十】... ...\n" +
            "... ...【爱武进】... ...\n" +
            "... ...【中天钢铁】... ...\n" +
            "... ...【81之家】... ...\n" +
            "... ...【长久物流】... ...\n" +
            "... ...【知识星球】... ...\n" +
            "... ...【小遛共享】... ...\n" +
            "... ...【易丰搬家】... ...\n" +
            "... ...【喜马拉雅儿童】... ...\n" +
            "... ...【小盒家长】... ...\n" +
            "... ...【天津出行】... ...\n" +
            "... ...【特仑苏名仕会】... ...\n" +
            "... ...【世纪高教】... ...\n" +
            "... ...【书生网络】... ...\n" +
            "... ...【趣出行】... ...\n" +
            "... ...【陕西富达物流】... ...\n" +
            "... ...【轻搜浏览器】... ...\n" +
            "... ...【南信大一卡通】... ...\n" +
            "... ...【牛职工作网】... ...\n" +
            "... ...【南大网院】... ...\n" +
            "... ...【萌果租机】... ...\n" +
            "... ...【米加】... ...\n" +
            "... ...【玲珑加速器】... ...\n" +
            "... ...【美团摩拜电单车】... ...\n" +
            "... ...【励步英语】... ...\n" +
            "... ...【乐天公司】... ...\n" +
            "... ...【绝味鸭脖】... ...\n" +
            "... ...【惠运通】... ...\n" +
            "... ...【捷径盒】... ...\n" +
            "... ...【华润万象会】... ...\n" +
            "... ...【华联物流】... ...\n" +
            "... ...【好孩子信息中心】... ...\n" +
            "... ...【行翼科技】... ...\n" +
            "... ...【海南志行】... ...\n" +
            "... ...【海马体儿童】... ...\n" +
            "... ...【光环国际】... ...\n" +
            "... ...【滴滴代驾】... ...\n" +
            "... ...【独山港全塘幼儿园】... ...\n" +
            "... ...【贝海国际速递】... ...\n" +
            "... ...【畅行商旅】... ...\n" +
            "... ...【北京比尔】... ...\n" +
            "... ...【宝马APP】... ...\n" +
            "... ...【YoTok】... ...\n" +
            "... ...【澳洋医院体检中心】... ...\n" +
            "... ...【TP-LINK安防】... ...\n" +
            "... ...【TCL电视】... ...\n" +
            "... ...【Microsoft】... ...\n" +
            "... ...【GODADDY】... ...\n" +
            "... ...【360点睛平台】... ...\n" +
            "... ...【纵横文学】... ...\n" +
            "... ...【中国国际能源】... ...\n" +
            "... ...【知呱呱】... ...\n" +
            "... ...【长安福特】... ...\n" +
            "... ...【云米全屋互联网家电】... ...\n" +
            "... ...【优益鼎教育】... ...\n" +
            "... ...【译国译民】... ...\n" +
            "... ...【燕文物流】... ...\n" +
            "... ...【新仓镇中心幼儿园】... ...\n" +
            "... ...【西瓜小说】... ...\n" +
            "... ...【途泰养车】... ...\n" +
            "... ...【探记记录】... ...\n" +
            "... ...【塔读】... ...\n" +
            "... ...【塔读文学】... ...\n" +
            "... ...【四季安物流】... ...\n" +
            "... ...【苏宁快递】... ...\n" +
            "... ...【七星中心幼儿园】... ...\n" +
            "... ...【喵特】... ...\n" +
            "... ...【美册】... ...\n" +
            "... ...【旅集网】... ...\n" +
            "... ...【金地集团】... ...\n" +
            "... ...【猎豹清理大师】... ...\n" +
            "... ...【徽托邦物流】... ...\n" +
            "... ...【红豆科技】... ...\n" +
            "... ...【华语数媒】... ...\n" +
            "... ...【广源物流】... ...\n" +
            "... ...【风行】... ...\n" +
            "... ...【蜂巢】... ...\n" +
            "... ...【步步阅读】... ...\n" +
            "... ...【飞利浦显示器】... ...\n" +
            "... ...【SEM线索通】... ...\n" +
            "... ...【奥买家】... ...\n" +
            "... ...【HCMCloud】... ...\n" +
            "... ...【CATL宁德时代】... ...\n" +
            "... ...【GO车网】... ...\n" +
            "... ...【正宝物流】... ...\n" +
            "... ...【365快递】... ...\n" +
            "... ...【爪谐商务电玩】... ...\n" +
            "... ...【折泡泡】... ...\n" +
            "... ...【新精武教育】... ...\n" +
            "... ...【一猫汽车网】... ...\n" +
            "... ...【无锡运动网】... ...\n" +
            "... ...【苏德乐】... ...\n" +
            "... ...【速问科技】... ...\n" +
            "... ...【丝途旅游网】... ...\n" +
            "... ...【趣喵】... ...\n" +
            "... ...【客满满商家】... ...\n" +
            "... ...【金顺物流】... ...\n" +
            "... ...【康师傅开盖有礼】... ...\n" +
            "... ...【教育部网培中心】... ...\n" +
            "... ...【广汽新能源】... ...\n" +
            "... ...【冠盛平台】... ...\n" +
            "... ...【福音短视频】... ...\n" +
            "... ...【诚中物流】... ...\n" +
            "... ...【比优视频】... ...\n" +
            "... ...【贝壳报警】... ...\n" +
            "... ...【贝贝帮】... ...\n" +
            "... ...【中通】... ...\n" +
            "... ...【张家港人才网】... ...\n" +
            "... ...【张家港教育】... ...\n" +
            "... ...【阅扑】... ...\n" +
            "... ...【泽成教育】... ...\n" +
            "... ...【学而思爱智康】... ...\n" +
            "... ...【优路教育】... ...\n" +
            "... ...【宿州中交出行】... ...\n" +
            "... ...【星骑出行】... ...\n" +
            "... ...【新宝伞业】... ...\n" +
            "... ...【小红绳】... ...\n" +
            "... ...【小盒学生】... ...\n" +
            "... ...【位知宝】... ...\n" +
            "... ...【入职道】... ...\n" +
            "... ...【企鹅兼职】... ...\n" +
            "... ...【猫眼演出】... ...\n" +
            "... ...【乐活青年社区】... ...\n" +
            "... ...【懒掌柜】... ...\n" +
            "... ...【开市客】... ...\n" +
            "... ...【鲸买网】... ...\n" +
            "... ...【金海物业】... ...\n" +
            "... ...【吉麦隆】... ...\n" +
            "... ...【江苏教育信息化】... ...\n" +
            "... ...【黄山风景区】... ...\n" +
            "... ...【虎扑】... ...\n" +
            "... ...【赶集网】... ...\n" +
            "... ...【多学】... ...\n" +
            "... ...【东风启辰】... ...\n" +
            "... ...【澳洋集团】... ...\n" +
            "... ...【智学平台分发资源】... ...\n" +
            "... ...【小桔加油】... ...\n" +
            "... ...【悦达集团】... ...\n" +
            "... ...【神州物流】... ...\n" +
            "... ...【人教点读】... ...\n" +
            "... ...【三星-SDIW】... ...\n" +
            "... ...【去哪儿网】... ...\n" +
            "... ...【金信物流】... ...\n" +
            "... ...【馒头商学院】... ...\n" +
            "... ...【博客园】... ...\n" +
            "... ...【GeSmart】... ...\n" +
            "... ...【贝壳】... ...\n" +
            "... ...【AI音乐学院】... ...\n" +
            "... ...【智慧泰兴】... ...\n" +
            "... ...【阅听文学】... ...\n" +
            "... ...【铁旅】... ...\n" +
            "... ...【上汽红岩】... ...\n" +
            "... ...【社享生活】... ...\n" +
            "... ...【美团买菜】... ...\n" +
            "... ...【快递e站】... ...\n" +
            "... ...【快递驿站】... ...\n" +
            "... ...【金日物流】... ...\n" +
            "... ...【玖龙纸业】... ...\n" +
            "... ...【核桃电话】... ...\n" +
            "... ...【佳怡物流】... ...\n" +
            "... ...【独墅湖科教公众服务】... ...\n" +
            "... ...【贝壳IT帮】... ...\n" +
            "... ...【递易智能】... ...\n" +
            "... ...【拜米出行】... ...\n" +
            "... ...【爱奇艺VIP】... ...\n" +
            "... ...【爱维尔】... ...\n" +
            "... ...【58/安居客短租】... ...\n" +
            "... ...【DaDa英语】... ...\n" +
            "... ...【影音先锋】... ...\n" +
            "... ...【悦达石油】... ...\n" +
            "... ...【省事物流平台】... ...\n" +
            "... ...【启东出租】... ...\n" +
            "... ...【黔中普洱在线】... ...\n" +
            "... ...【欧康共享陪护床】... ...\n" +
            "... ...【珀芙研】... ...\n" +
            "... ...【江苏海州湾集团】... ...\n" +
            "... ...【快狗打车企业版】... ...\n" +
            "... ...【奥的斯电梯】... ...\n" +
            "... ...【飞鹅订单助手】... ...\n" +
            "... ...【中石化森美】... ...\n" +
            "... ...【E环保】... ...\n" +
            "... ...【长佩文学】... ...\n" +
            "... ...【亚教网】... ...\n" +
            "... ...【小龟充电】... ...\n" +
            "... ...【亚东水泥】... ...\n" +
            "... ...【猎豹应用APP】... ...\n" +
            "... ...【如视VR】... ...\n" +
            "... ...【国家电投】... ...\n" +
            "... ...【形式富华物流】... ...\n" +
            "... ...【天天趣闻】... ...\n" +
            "... ...【票付通】... ...\n" +
            "... ...【美年大健康-瑞美】... ...\n" +
            "... ...【蓝晶社】... ...\n" +
            "... ...【聚美】... ...\n" +
            "... ...【极速打车】... ...\n" +
            "... ...【京东智联云】... ...\n" +
            "... ...【鸿泰物流】... ...\n" +
            "... ...【吉林烟草工业】... ...\n" +
            "... ...【360搜索推广】... ...\n" +
            "... ...【享拍视频】... ...\n" +
            "... ...【申铁建设】... ...\n" +
            "... ...【上汽通用汽车】... ...\n" +
            "... ...【瑞卡租车】... ...\n" +
            "... ...【客音商务】... ...\n" +
            "... ...【蒙牛】... ...\n" +
            "... ...【车家】... ...\n" +
            "... ...【凯莱物流】... ...\n" +
            "... ...【碧桂园智慧物业】... ...\n" +
            "... ...【韵达】... ...\n" +
            "... ...【中国海油】... ...\n" +
            "... ...【同程艺龙】... ...\n" +
            "... ...【金鼎物流】... ...\n" +
            "... ...【滔搏国际】... ...\n" +
            "... ...【好多车】... ...\n" +
            "... ...【杜家物流】... ...\n" +
            "... ...【海康威视售后服务部】... ...\n" +
            "... ...【状元K书馆】... ...\n" +
            "... ...【掌上科技】... ...\n" +
            "... ...【圆通】... ...\n" +
            "... ...【首汽约车】... ...\n" +
            "... ...【神州租车】... ...\n" +
            "... ...【恐龙园】... ...\n" +
            "... ...【考道网】... ...\n" +
            "... ...【百世汇通】... ...\n" +
            "... ...【鱼丸星球】... ...\n" +
            "... ...【安能物流】... ...\n" +
            "... ...【盈客在线】... ...\n" +
            "... ...【链家】... ...\n" +
            "... ...【快报报】... ...\n" +
            "... ...【高途课堂】... ...\n" +
            "... ...【教育宝】... ...\n" +
            "... ...【无忧家政】... ...\n" +
            "... ...【美团收银】... ...\n" +
            "... ...【孩子王】... ...\n" +
            "... ...【GoFun出行】... ...\n" +
            "... ...【东风日产】... ...\n" +
            "... ...【上汽名爵】... ...\n" +
            "... ...【联通云盾】... ...\n" +
            "... ...【蔷薇社区】... ...\n" +
            "... ...【客多多】... ...\n" +
            "... ...【飞马配送】... ...\n" +
            "... ...【花椒】... ...\n" +
            "... ...【滴滴出行】... ...\n" +
            "... ...【递速物流】... ...\n" +
            "... ...【致远互联】... ...\n" +
            "... ...【安能快递】... ...\n" +
            "... ...【心心App】... ...\n" +
            "... ...【腰果公考】... ...\n" +
            "... ...【健总管】... ...\n" +
            "... ...【饿了么星选】... ...\n" +
            "... ...【汇通快递】... ...\n" +
            "... ...【长通物流】... ...\n" +
            "... ...【优乐】... ...\n" +
            "... ...【启承教育】... ...\n" +
            "... ...【快团团】... ...\n" +
            "... ...【纳米盒】... ...\n" +
            "... ...【叮嗒出行】... ...\n" +
            "... ...【光猪圈健身】... ...\n" +
            "... ...【探探Tantan】... ...\n" +
            "... ...【爱云兔】... ...\n" +
            "... ...【丁香妈妈】... ...\n" +
            "... ...【美团电单车】... ...\n" +
            "... ...【包夫快递超市】... ...\n" +
            "... ...【德邦物流】... ...\n" +
            "... ...【家校无忧】... ...\n" +
            "... ...【咸鱼】... ...\n" +
            "... ...【点众阅读】... ...\n" +
            "... ...【逗游网】... ...\n" +
            "... ...【永盛物流】... ...\n" +
            "... ...【中储粮网】... ...\n" +
            "... ...【学成网课】... ...\n" +
            "... ...【唱吧】... ...\n" +
            "... ...【网易严选】... ...\n" +
            "... ...【易代买】... ...\n" +
            "... ...【每日瑜伽】... ...\n" +
            "... ...【刷宝短视频】... ...\n" +
            "... ...【贝壳招聘】... ...\n" +
            "... ...【立邦中国】... ...\n" +
            "... ...【中联物流】... ...\n" +
            "... ...【淘木网】... ...\n" +
            "... ...【金山毒霸】... ...\n" +
            "... ...【驴妈妈】... ...\n" +
            "... ...【YY一件】... ...\n" +
            "... ...【鲸鱼外教培优】... ...\n" +
            "... ...【读书郎】... ...\n" +
            "... ...【盛行天下】... ...\n" +
            "... ...【叮咚课堂】... ...\n" +
            "... ...【快点App】... ...\n" +
            "... ...【米饭公社】... ...\n" +
            "... ...【新百丽】... ...\n" +
            "... ...【金山云】... ...\n" +
            "... ...【蜂达达】... ...\n" +
            "... ...【慈音短视频】... ...\n" +
            "... ...【烽鸟共享汽车】... ...\n" +
            "... ...【叮当管家】... ...\n" +
            "... ...【云喇叭快递】... ...\n" +
            "... ...【OPPO】... ...\n" +
            "... ...【星巴克中国】... ...\n" +
            "... ...【闹闹派单】... ...\n" +
            "... ...【喜茶GO】... ...\n" +
            "... ...【英语趣配音】... ...\n" +
            "... ...【万科物业】... ...\n" +
            "... ...【海康威视】... ...\n" +
            "... ...【少儿趣配音】... ...\n" +
            "... ...【EMS快递】... ...\n" +
            "... ...【随身译】... ...\n" +
            "... ...【幼安宝】... ...\n" +
            "... ...【迈外迪】... ...\n" +
            "... ...【三棵树】... ...\n" +
            "... ...【悦途出行】... ...\n" +
            "... ...【途牛旅游网】... ...\n" +
            "... ...【萤石网络】... ...\n" +
            "... ...【快驴进货】... ...\n" +
            "... ...【蘑菇街】... ...\n" +
            "... ...【今日张家港】... ...\n" +
            "... ...【喜马拉雅极速版】... ...\n" +
            "... ...【豪翔物流】... ...\n" +
            "... ...【贝壳如视】... ...\n" +
            "... ...【凤凰网】... ...\n" +
            "... ...【TCL集团】... ...\n" +
            "... ...【顺丰KC】... ...\n" +
            "... ...【科大讯飞】... ...\n" +
            "... ...【玛箭易下单】... ...\n" +
            "... ...【动漫之家】... ...\n" +
            "... ...【STARBUCKS NOW】... ...\n" +
            "... ...【上汽大通】... ...\n" +
            "... ...【速哇通知】... ...\n" +
            "... ...【东风出行】... ...\n" +
            "... ...【顺丰快递】... ...\n" +
            "... ...【自然堂】... ...\n" +
            "... ...【丰巢代发】... ...\n" +
            "... ...【中大网校】... ...\n" +
            "... ...【九牧厨卫】... ...\n" +
            "... ...【Adobe】... ...\n" +
            "... ...【美团单车】... ...\n" +
            "... ...【智云联盟】... ...\n" +
            "... ...【南京大学访客通行】... ...\n" +
            "... ...【有家民宿】... ...\n" +
            "... ...【驾校一点通】... ...\n" +
            "... ...【白名单威客网】... ...\n" +
            "... ...【酷安】... ...\n" +
            "... ...【KLOOK】... ...\n" +
            "... ...【58赶集安居客】... ...\n" +
            "... ...【拉购科技】... ...\n" +
            "... ...【校友邦】... ...\n" +
            "... ...【小鹅通】... ...\n" +
            "... ...【万顺叫车】... ...\n" +
            "... ...【学而思】... ...\n" +
            "... ...【橙啦】... ...\n" +
            "... ...【快影】... ...\n" +
            "... ...【说客英语】... ...\n" +
            "... ...【贝店】... ...\n" +
            "... ...【中康体检网】... ...\n" +
            "... ...【阿卡索】... ...\n" +
            "... ...【Unipus】... ...\n" +
            "... ...【快递管家】... ...\n" +
            "... ...【泰迪熊】... ...\n" +
            "... ...【同程旅行】... ...\n" +
            "... ...【首旅如家】... ...\n" +
            "... ...【我要自学网】... ...\n" +
            "... ...【百世物流】... ...\n" +
            "... ...【织音App】... ...\n" +
            "... ...【酷音铃声】... ...\n" +
            "... ...【无忧考网】... ...\n" +
            "... ...【跟谁学】... ...\n" +
            "... ...【城客e家】... ...\n" +
            "... ...【畅言普通话】... ...\n" +
            "... ...【EGEME】... ...\n" +
            "... ...【米粒优品】... ...\n" +
            "... ...【财源物流】... ...\n" +
            "... ...【中国粮油商务网】... ...\n" +
            "... ...【luckin coffee】... ...\n" +
            "... ...【喜茶】... ...\n" +
            "... ...【中通星联】... ...\n" +
            "... ...【创维集团】... ...\n" +
            "... ...【ClassIn】... ...\n" +
            "... ...【京东快递柜】... ...\n" +
            "... ...【隆众资讯】... ...\n" +
            "... ...【悦动圈】... ...\n" +
            "... ...【携程】... ...\n" +
            "... ...【京东快递】... ...\n" +
            "... ...【雷速体育】... ...\n" +
            "... ...【新网】... ...\n" +
            "... ...【1号店】... ...\n" +
            "... ...【滔搏运动】... ...\n" +
            "... ...【AcFun弹幕视频网】... ...\n" +
            "... ...【豌豆思维VIPThink】... ...\n" +
            "... ...【上汽荣威】... ...\n" +
            "... ...【上海林内】... ...\n" +
            "... ...【三星电子】... ...\n" +
            "... ...【爱WiFi】... ...\n" +
            "... ...【中通快运】... ...\n" +
            "... ...【安居客】... ...\n" +
            "... ...【小说阅读吧】... ...\n" +
            "... ...【心甜智能柜】... ...\n" +
            "... ...【简书】... ...\n" +
            "... ...【韵达快递】... ...\n" +
            "... ...【日日顺乐家】... ...\n" +
            "... ...【汽车之家】... ...\n" +
            "... ...【嘀嗒出行】... ...\n" +
            "... ...【申通快递】... ...\n" +
            "... ...【美团外卖】... ...\n" +
            "... ...【京东物流】... ...\n" +
            "... ...【菜鸟驿站】... ...\n" +
            "... ...【顺丰同城急送】... ...\n" +
            "... ...【网易】... ...\n" +
            "... ...【美团网】... ...\n" +
            "... ...【丰巢】... ...\n" +
            "... ...【拼多多】... ...\n" +
            "... ...【威尔士健身】... ...\n" +
            "... ...【讯飞听见】... ...\n" +
            "... ...【起点中文网】... ...\n" +
            "... ...【百信银行】... ...\n" +
            "... ...【百度帐号】... ...\n" +
            "... ...【快看漫画】... ...\n" +
            "... ...【唯品会】... ...\n" +
            "... ...【小牛电动】... ...\n" +
            "... ...【海尔】... ...\n" +
            "... ...【有道精品课】... ...\n" +
            "... ...【联想】... ...\n" +
            "... ...【美团摩拜单车】... ...\n" +
            "... ...【百望云】... ...\n" +
            "... ...【云米科技】... ...\n" +
            "... ...【极兔快递】... ...\n" +
            "... ...【新东方在线中小学】... ...\n" +
            "... ...【圆通速递】... ...\n" +
            "... ...【韵达快运】... ...\n" +
            "... ...【安时达】... ...\n" +
            "... ...【好运达】... ...\n" +
            "... ...【兔喜快递柜】... ...\n" +
            "... ...【TCL服务】... ...\n" +
            "... ...【菜鸟网络】... ...\n" +
            "... ...【快钱】... ...\n" +
            "... ...【天天快递】... ...\n" +
            "... ...【韵达速递】... ...\n" +
            "... ...【极兔速递】... ...\n" +
            "... ...【转转】... ...\n" +
            "... ...【WPS云服务】... ...\n" +
            "... ...【快音短音乐】... ...\n" +
            "... ...【健康通】... ...\n" +
            "... ...【邮政快递】... ...\n" +
            "... ...【中纤网】... ...\n" +
            "... ...【京东互联网医院】... ...\n" +
            "... ...【行车卫士】... ...\n" +
            "... ...【中国邮政】... ...\n" +
            "... ...【快手小店】... ...\n" +
            "... ...【百世邻里】... ...\n" +
            "... ...【新东方在线】... ...\n" +
            "... ...【丰巢服务站】... ...\n" +
            "... ...【掌上高铁】... ...\n" +
            "... ...【易车】... ...\n" +
            "... ...【食行生鲜】... ...\n" +
            "... ...【掌通家园】... ...\n" +
            "... ...【UTo出行】... ...\n" +
            "... ...【K米】... ...\n" +
            "... ...【美团民宿】... ...\n" +
            "... ...【阅文集团】... ...\n" +
            "... ...【妈妈驿站】... ...\n" +
            "... ...【日日顺】... ...\n" +
            "... ...【百动网】... ...\n" +
            "... ...【学而思网校】... ...\n" +
            "... ...【快递客栈】... ...\n" +
            "... ...【学习通】... ...\n" +
            "... ...【婚礼纪】... ...\n" +
            "... ...【Keep】... ...\n" +
            "... ...【汉堡王官方旗舰店】... ...\n" +
            "... ...【壹米滴答】... ...\n" +
            "... ...【爱奇艺】... ...\n" +
            "... ...【吴中联动中心】... ...\n" +
            "... ...【YY语音】... ...\n" +
            "... ...【麦当劳】... ...\n" +
            "... ...【尚德机构】... ...\n" +
            "... ...【百世快递】... ...\n" +
            "... ...【百度】... ...\n" +
            "... ...【美团支付】... ...\n" +
            "... ...【优速快递】... ...\n" +
            "... ...【链家网】... ...\n" +
            "... ...【美团打车】... ...\n" +
            "... ...【贝壳经纪学院】... ...\n" +
            "... ...【喜马拉雅】... ...\n" +
            "... ...【快狗打车】... ...\n" +
            "... ...【美团跑腿】... ...\n" +
            "... ...【芒果tv】... ...\n" +
            "... ...【大众点评】... ...\n" +
            "... ...【完美世界】... ...\n" +
            "... ...【通行宝】... ...\n" +
            "... ...【微店】... ...\n" +
            "... ...【云喇叭】... ...\n" +
            "... ...【圆通快递】... ...\n" +
            "... ...【佳华友盛】... ...\n" +
            "... ...【小米】... ...\n" +
            "... ...【德邦快递】... ...\n" +
            "... ...【韵达超市】... ...\n" +
            "... ...【三星】... ...\n" +
            "... ...【饿了么】... ...\n" +
            "... ...【快手科技】... ...\n" +
            "... ...【曹操出行】... ...\n" +
            "... ...【58同城】... ...\n" +
            "... ...【中通快递】... ...\n" +
            "... ...【虎牙科技】... ...\n" +
            "... ...【HotBazaar】... ...\n" +
            "... ...【星巴克啡快】... ...\n" +
            "... ...【象屿屿果公寓】... ...\n" +
            "... ...【湘下佬】... ...\n" +
            "... ...【暹罗素可泰】... ...\n" +
            "... ...【希尔顿欢朋】... ...\n" +
            "... ...【物泊科技】... ...\n" +
            "... ...【武汉赫本酒吧】... ...\n" +
            "... ...【伍易】... ...\n" +
            "... ...【无忧保姆】... ...\n" +
            "... ...【违章缴费易】... ...\n" +
            "... ...【薇家珠宝】... ...\n" +
            "... ...【微赞同城】... ...\n" +
            "... ...【微友助手】... ...\n" +
            "... ...【微号帮】... ...\n" +
            "... ...【天下商机】... ...\n" +
            "... ...【淘云科技】... ...\n" +
            "... ...【碳云智能】... ...\n" +
            "... ...【太仓公安】... ...\n" +
            "... ...【太仓港电子口岸】... ...\n" +
            "... ...【苏州妇儿】... ...\n" +
            "... ...【视铃DIY】... ...\n" +
            "... ...【实验东景园区】... ...\n" +
            "... ...【深行赛事】... ...\n" +
            "... ...【儒思HR】... ...\n" +
            "... ...【容联七陌】... ...\n" +
            "... ...【戎光科技】... ...\n" +
            "... ...【谦阳科技】... ...\n" +
            "... ...【彭水县水利局】... ...\n" +
            "... ...【潘德朋麻辣烫】... ...\n" +
            "... ...【牛听听】... ...\n" +
            "... ...【柠檬爱美】... ...\n" +
            "... ...【南京百家云网校】... ...\n" +
            "... ...【摩励商城】... ...\n" +
            "... ...【喵享】... ...\n" +
            "... ...【蜜蛋网】... ...\n" +
            "... ...【满堂信誉】... ...\n" +
            "... ...【麦德龙EMS】... ...\n" +
            "... ...【龙凤珠宝】... ...\n" +
            "... ...【连人才】... ...\n" +
            "... ...【劳卡全屋定制】... ...\n" +
            "... ...【可爱可亲】... ...\n" +
            "... ...【京豆网络科技】... ...\n" +
            "... ...【京东钱包】... ...\n" +
            "... ...【锦郁商城】... ...\n" +
            "... ...【匠心小镇】... ...\n" +
            "... ...【江苏朗拓】... ...\n" +
            "... ...【江北新区图审中心】... ...\n" +
            "... ...【会小二】... ...\n" +
            "... ...【花王妙而舒】... ...\n" +
            "... ...【湖南高速】... ...\n" +
            "... ...【鸿泽百货】... ...\n" +
            "... ...【哈中柏杜法考】... ...\n" +
            "... ...【噶洛赛贸易】... ...\n" +
            "... ...【服务商司机】... ...\n" +
            "... ...【丰县人才网】... ...\n" +
            "... ...【粉丝生活】... ...\n" +
            "... ...【东方团购中心】... ...\n" +
            "... ...【第一物业】... ...\n" +
            "... ...【大昌出行】... ...\n" +
            "... ...【畅速网络】... ...\n" +
            "... ...【北港协同OA】... ...\n" +
            "... ...【办得爽】... ...\n" +
            "... ...【百花艺幼】... ...\n" +
            "... ...【爱丽丝的衣橱】... ...\n" +
            "... ...【爱查ICP】... ...\n" +
            "... ...【爱比邻】... ...\n" +
            "... ...【艾奇在线】... ...\n" +
            "... ...【艾媒咨询】... ...\n" +
            "... ...【阿拉秀】... ...\n" +
            "... ...【V积分】... ...\n" +
            "... ...【PaperPass】... ...\n" +
            "... ...【niniCASA生活馆】... ...\n" +
            "... ...【Lysn】... ...\n" +
            "... ...【FESCO科技】... ...\n" +
            "... ...【FESCO】... ...\n" +
            "... ...【DNS.COM】... ...\n" +
            "... ...【DC私房烘焙】... ...\n" +
            "... ...【C联盟】... ...\n" +
            "... ...【blingabc】... ...\n" +
            "... ...【968966马上办】... ...\n" +
            "... ...【7ELEVEN】... ...\n" +
            "... ...【中国药师协会】... ...\n" +
            "... ...【中国e车】... ...\n" +
            "... ...【余杭交警】... ...\n" +
            "... ...【有马车装】... ...\n" +
            "... ...【邮政小包】... ...\n" +
            "... ...【宜家家居】... ...\n" +
            "... ...【寻欢APP】... ...\n" +
            "... ...【信友云】... ...\n" +
            "... ...【新网程】... ...\n" +
            "... ...【新区12345】... ...\n" +
            "... ...【啸博网络科技】... ...\n" +
            "... ...【小电铺】... ...\n" +
            "... ...【悟空中文】... ...\n" +
            "... ...【舞佰APP】... ...\n" +
            "... ...【万变云】... ...\n" +
            "... ...【鸵鸟货运】... ...\n" +
            "... ...【太仓安宣安全】... ...\n" +
            "... ...【首创奥莱】... ...\n" +
            "... ...【市民云】... ...\n" +
            "... ...【市规划自然资源局】... ...\n" +
            "... ...【世茂新城幼儿园】... ...\n" +
            "... ...【省政务服务中心】... ...\n" +
            "... ...【深圳国际家具展】... ...\n" +
            "... ...【上海特易】... ...\n" +
            "... ...【人本】... ...\n" +
            "... ...【启点科技】... ...\n" +
            "... ...【糯米团】... ...\n" +
            "... ...【迷鹿音乐】... ...\n" +
            "... ...【美果服饰】... ...\n" +
            "... ...【麦秀优选】... ...\n" +
            "... ...【六台阶】... ...\n" +
            "... ...【老船长泡芙】... ...\n" +
            "... ...【君润人力】... ...\n" +
            "... ...【聚兴】... ...\n" +
            "... ...【华展云】... ...\n" +
            "... ...【华埠停车】... ...\n" +
            "... ...【虹强百科】... ...\n" +
            "... ...【红师汇烁】... ...\n" +
            "... ...【红杉树】... ...\n" +
            "... ...【翰程网络】... ...\n" +
            "... ...【蜂站】... ...\n" +
            "... ...【丰速科技】... ...\n" +
            "... ...【东航】... ...\n" +
            "... ...【呆萝卜】... ...\n" +
            "... ...【创客云商】... ...\n" +
            "... ...【创就羚】... ...\n" +
            "... ...【城地建设招采中心】... ...\n" +
            "... ...【伴奏王】... ...\n" +
            "... ...【百世沃森】... ...\n" +
            "... ...【百世】... ...\n" +
            "... ...【百丽男鞋专营】... ...\n" +
            "... ...【凹凸宇宙】... ...\n" +
            "... ...【Y2002电音】... ...\n" +
            "... ...【WIFI云管家】... ...\n" +
            "... ...【种草生活】... ...\n" +
            "... ...【中瑞物资】... ...\n" +
            "... ...【邮政便民信包箱】... ...\n" +
            "... ...【樱桃聊天交友】... ...\n" +
            "... ...【壹生】... ...\n" +
            "... ...【星球网络】... ...\n" +
            "... ...【小狗在家】... ...\n" +
            "... ...【西蒂APP】... ...\n" +
            "... ...【文峰】... ...\n" +
            "... ...【微多猫】... ...\n" +
            "... ...【天博】... ...\n" +
            "... ...【速速通】... ...\n" +
            "... ...【盛壹科技】... ...\n" +
            "... ...【深圳盐田】... ...\n" +
            "... ...【陕西CA】... ...\n" +
            "... ...【千语千寻】... ...\n" +
            "... ...【小蓝帽】... ...\n" +
            "... ...【新电途】... ...\n" +
            "... ...【新华网手机党校】... ...\n" +
            "... ...【快如科技】... ...\n" +
            "... ...【云南省卫生健康委员会】... ...\n" +
            "... ...【陕西省应对新冠肺炎指挥部】... ...\n" +
            "... ...【昆山平安驾驶员培训股份有限公司】... ...\n" +
            "... ...【淮安经济技术开发区管理委员会】... ...\n" +
            "... ...【厦门麻花网络科技有限公司】... ...\n" +
            "... ...【苏州公共资源交易中心】... ...\n" +
            "... ...【猎豹清理大师无广告版】... ...\n" +
            "... ...【沛县公安局胡寨派出所】... ...\n" +
            "... ...【鹰潭林奥科技有限公司】... ...\n" +
            "... ...【江苏省技术产权交易市场】... ...\n" +
            "... ...【美年健康美兆医疗】... ...\n" +
            "... ...【沛县公安局栖山派出所】... ...\n" +
            "... ...【全国退役军人信访信息系统】... ...\n" +
            "... ...【温州汉考克网络科技】... ...\n" +
            "... ...【宁夏市场监督管理厅】... ...\n" +
            "... ...【丰昂人力】... ...\n" +
            "... ...【星直播】... ...\n" +
            "... ...【我帮充】... ...\n" +
            "... ...【中包装茶】... ...\n" +
            "... ...【运动赚】... ...\n" +
            "... ...【中交路建】... ...\n" +
            "... ...【易卡发卡平台】... ...\n" +
            "... ...【智慧队建】... ...\n" +
            "... ...【建造工】... ...\n" +
            "... ...【格格小区】... ...\n" +
            "... ...【南京恒星】... ...\n" +
            "... ...【达目标】... ...\n" +
            "... ...【华润置地】... ...\n" +
            "... ...【直播吧】... ...\n" +
            "... ...【优区生活】... ...\n" +
            "... ...【宿迁市不动产】... ...\n" +
            "... ...【天亿乐购】... ...\n" +
            "... ...【快熊】... ...\n" +
            "... ...【精臣智慧标识】... ...\n" +
            "... ...【蚂蚁信息技术】... ...\n" +
            "... ...【好医术】... ...\n" +
            "... ...【华夏收藏】... ...\n" +
            "... ...【住多多】... ...\n" +
            "... ...【紫微大师】... ...\n" +
            "... ...【23魔方】... ...\n" +
            "... ...【hugoboss】... ...\n" +
            "... ...【驭吧】... ...\n" +
            "... ...【桃缘交友】... ...\n" +
            "... ...【遇见交友】... ...\n" +
            "... ...【每天读点故事】... ...\n" +
            "... ...【嗖嗖商家】... ...\n" +
            "... ...【喜翻】... ...\n" +
            "... ...【山山快修】... ...\n" +
            "... ...【美容美体网】... ...\n" +
            "... ...【句读】... ...\n" +
            "... ...【好好住】... ...\n" +
            "... ...【广东益升】... ...\n" +
            "... ...【e家康护】... ...\n" +
            "... ...【爱信诺】... ...\n" +
            "... ...【百家云】... ...\n" +
            "... ...【协和干细胞】... ...\n" +
            "... ...【医护到家】... ...\n" +
            "... ...【用药助手】... ...\n" +
            "... ...【美食流】... ...\n" +
            "... ...【启悦生活】... ...\n" +
            "... ...【轻蜂】... ...\n" +
            "... ...【富宝网】... ...\n" +
            "... ...【北瓜电话】... ...\n" +
            "... ...【大智惠享】... ...\n" +
            "... ...【当换】... ...\n" +
            "... ...【定位大师】... ...\n" +
            "... ...【荷小鱼】... ...\n" +
            "... ...【上海睦欣】... ...\n" +
            "... ...【广东互通】... ...\n" +
            "... ...【到位】... ...\n" +
            "... ...【创微达网络科技】... ...\n" +
            "... ...【知而行】... ...\n" +
            "... ...【坚果云】... ...\n" +
            "... ...【联通智慧安全】... ...\n" +
            "... ...【福型象】... ...\n" +
            "... ...【探知】... ...\n" +
            "... ...【贝壳找房潜客包】... ...\n" +
            "... ...【ADP】... ...\n" +
            "... ...【可甜REAL】... ...\n" +
            "... ...【巨龙网】... ...\n" +
            "... ...【派件助手】... ...\n" +
            "... ...【传化智联】... ...\n" +
            "... ...【房江湖】... ...\n" +
            "... ...【酒仙网】... ...\n" +
            "... ...【对啊网】... ...\n" +
            "... ...【安吉四维】... ...\n" +
            "... ...【淘气旺】... ...\n" +
            "... ...【红山通】... ...\n" +
            "... ...【微问家】... ...\n" +
            "... ...【网龙】... ...\n" +
            "... ...【巨人网络】... ...\n" +
            "... ...【多多数字】... ...\n" +
            "... ...【ZARA】... ...\n" +
            "... ...【展商秀】... ...\n";
}


